<a href="https://colab.research.google.com/github/Davis-Tony/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-07-14 19:51:31--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.101.38
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.101.38|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  96.1MB/s    in 2.0s

2020-07-14 19:51:33 (96.1 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [5]:
##### YOUR CODE HERE #####
#importing the usual suspects
import pandas as pd
import numpy as np

In [98]:
#reading in data
orders = pd.read_csv("/content/instacart_2017_05_01/orders.csv")
products = pd.read_csv("/content/instacart_2017_05_01/products.csv")
order_products_train = pd.read_csv("/content/instacart_2017_05_01/order_products__train.csv")
order_products_prior = pd.read_csv("/content/instacart_2017_05_01/order_products__prior.csv")

In [50]:
#Checking dataframes
print(orders.sample(4))
print(products.head())
order_products_train.head()

         order_id  user_id eval_set  order_number  order_dow  \
2820877    544322   170194    prior            21          4
1827493   2479337   109766    prior            20          6
2034861    646850   122241    prior            11          1
2348890    818104   141399    prior            11          0

         order_hour_of_day  days_since_prior_order
2820877                 17                     2.0
1827493                  2                    12.0
2034861                 16                     4.0
2348890                  9                     9.0
   product_id                                       product_name  aisle_id  \
0           1                         Chocolate Sandwich Cookies        61
1           2                                   All-Seasons Salt       104
2           3               Robust Golden Unsweetened Oolong Tea        94
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...        38
4           5                          Green Chile Anytime Sauce         5

   department_id
0             19
1             13
2              7
3              1
4             13

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [46]:
#Since orders' column names is being truncated
orders.columns

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'order_dow',
       'order_hour_of_day', 'days_since_prior_order'],
      dtype='object')

In [30]:
products.shape

(49688, 4)

In [35]:
product_names = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 'Organic Baby Spinach',
                 'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']

In [91]:
#DataFrame with product names
product_dict = {'product_name': ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 'Organic Baby Spinach',
                 'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']}
productnames = pd.DataFrame(product_dict)
productnames

             product_name
0                  Banana
1  Bag of Organic Bananas
2    Organic Strawberries
3    Organic Baby Spinach
4    Organic Hass Avocado
5         Organic Avocado
6             Large Lemon
7            Strawberries
8                   Limes
9      Organic Whole Milk

In [82]:
#Making DataFrame for Products
productsdf = pd.DataFrame(products)

In [93]:
productnameid = pd.merge(productnames, productsdf)
productnameid

             product_name  product_id  aisle_id  department_id
0                  Banana       24852        24              4
1  Bag of Organic Bananas       13176        24              4
2    Organic Strawberries       21137        24              4
3    Organic Baby Spinach       21903       123              4
4    Organic Hass Avocado       47209        24              4
5         Organic Avocado       47766        24              4
6             Large Lemon       47626        24              4
7            Strawberries       16797        24              4
8                   Limes       26209        24              4
9      Organic Whole Milk       27845        84             16

In [95]:
#filtering down to the specific product information
productcols = ['product_name', 'product_id']

productnameid = productnameid[productcols].copy()
productnameid

             product_name  product_id
0                  Banana       24852
1  Bag of Organic Bananas       13176
2    Organic Strawberries       21137
3    Organic Baby Spinach       21903
4    Organic Hass Avocado       47209
5         Organic Avocado       47766
6             Large Lemon       47626
7            Strawberries       16797
8                   Limes       26209
9      Organic Whole Milk       27845

In [117]:
#Finding product counts
product_counts = pd.DataFrame(data= order_products['product_id'].value_counts())
product_counts.reset_index(level=0, inplace=True)
#renaming column names
product_counts.rename(columns={'index':'product_id', 'product_id':'total_count'}, inplace=True)
product_counts.head(10)

   product_id  total_count
0       24852       491291
1       13176       394930
2       21137       275577
3       21903       251705
4       47209       220877
5       47766       184224
6       47626       160792
7       16797       149445
8       26209       146660
9       27845       142813

In [118]:
#Merging DataFrames to get counts for the top ten items
solution = pd.merge(productnameid, product_counts)
solution

             product_name  product_id  total_count
0                  Banana       24852       491291
1  Bag of Organic Bananas       13176       394930
2    Organic Strawberries       21137       275577
3    Organic Baby Spinach       21903       251705
4    Organic Hass Avocado       47209       220877
5         Organic Avocado       47766       184224
6             Large Lemon       47626       160792
7            Strawberries       16797       149445
8                   Limes       26209       146660
9      Organic Whole Milk       27845       142813

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [119]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [120]:
# table2 -> tidy
#Getting column names as a list
table2.columns.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [122]:
#Index values as another list
table2.index.tolist()
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [123]:
#Converting index to column
table2=table1.reset_index()
table2

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [125]:
#Converting from wide to tidy
tidy2 = table2.melt(id_vars = 'index', value_vars=['treatmenta', 'treatmentb'])
tidy2

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [129]:
#Renaming Columns
tidy2 = tidy2.rename(columns={'index': 'patientname', 'variable':'trt', 'value':'result'})
tidy2

    patientname trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [127]:
#Shortening 'trt' column
tidy2['trt'] = tidy2['trt'].str.replace('treatment', '')
tidy2

          index trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [130]:
# tidy -> table2
#Goidn back to wide formatting
wide2 = tidy2.pivot_table(index='patientname', columns='trt', values='result')
wide2

trt              a     b
patientname
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [136]:
#Loading Flight Data
import seaborn as sns
flights = sns.load_dataset('flights')
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [139]:
# Flights Pivot Table
Flightspivot = flights.pivot_table(values='passengers', index='year', columns='month')
Flightspivot

month,January,February,March,April,May,June,July,August,September,October,November,December
year,,,,,,,,,,,,
1949,112,118,132,129,121,135,148,148,136,119,104,118
1950,115,126,141,135,125,149,170,170,158,133,114,140
1951,145,150,178,163,172,178,199,199,184,162,146,166
1952,171,180,193,181,183,218,230,242,209,191,172,194
1953,196,196,236,235,229,243,264,272,237,211,180,201
1954,204,188,235,227,234,264,302,293,259,229,203,229
1955,242,233,267,269,270,315,364,347,312,274,237,278
1956,284,277,317,313,318,374,413,405,355,306,271,306
1957,315,301,356,348,355,422,465,467,404,347,305,336
1958,340,318,362,348,363,435,491,505,404,359,310,337
1959,360,342,406,396,420,472,548,559,463,407,362,405
1960,417,391,419,461,472,535,622,606,508,461,390,432

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [ ]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####